petclinic_modulith_sync/src/test/jmeter/delete_pet_results/statistics.json
{
  "DELETE Pet" : {
    "transaction" : "DELETE Pet",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.384615384615387,
    "medianResTime" : 18.0,
    "minResTime" : 13.0,
    "maxResTime" : 77.0,
    "pct1ResTime" : 63.79999999999999,
    "pct2ResTime" : 77.0,
    "pct3ResTime" : 77.0,
    "throughput" : 1.4865637507146943,
    "receivedKBytesPerSec" : 7.159559927101201,
    "sentKBytesPerSec" : 0.5058694253859348
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 52,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.75000000000001,
    "medianResTime" : 9.5,
    "minResTime" : 5.0,
    "maxResTime" : 455.0,
    "pct1ResTime" : 33.60000000000002,
    "pct2ResTime" : 58.149999999999835,
    "pct3ResTime" : 455.0,
    "throughput" : 5.466778805719091,
    "receivedKBytesPerSec" : 18.06024626787216,
    "sentKBytesPerSec" : 1.1148540987699747
  },
  "DELETE Pet-1" : {
    "transaction" : "DELETE Pet-1",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.923076923076922,
    "medianResTime" : 8.0,
    "minResTime" : 5.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 22.799999999999997,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 1.4949402023919043,
    "receivedKBytesPerSec" : 6.925328455611775,
    "sentKBytesPerSec" : 0.18114021532888686
  },
  "DELETE Pet-0" : {
    "transaction" : "DELETE Pet-0",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.23076923076923,
    "medianResTime" : 10.0,
    "minResTime" : 8.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 43.199999999999996,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 48.0,
    "throughput" : 1.488947428702325,
    "receivedKBytesPerSec" : 0.27347329200549764,
    "sentKBytesPerSec" : 0.3262665001145344
  },
  "Delete Pet" : {
    "transaction" : "Delete Pet",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42.46153846153846,
    "medianResTime" : 8.0,
    "minResTime" : 7.0,
    "maxResTime" : 455.0,
    "pct1ResTime" : 276.99999999999983,
    "pct2ResTime" : 455.0,
    "pct3ResTime" : 455.0,
    "throughput" : 1.4153511159499184,
    "receivedKBytesPerSec" : 5.070044569951007,
    "sentKBytesPerSec" : 0.19127228497550353
  }
}