petclinic_modulith_sync/src/test/jmeter/results/statistics.json
{
  "CSS" : {
    "transaction" : "CSS",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2930.226200000002,
    "medianResTime" : 2803.0,
    "minResTime" : 1.0,
    "maxResTime" : 8564.0,
    "pct1ResTime" : 4895.0,
    "pct2ResTime" : 5727.9,
    "pct3ResTime" : 7284.9299999999985,
    "throughput" : 5.0728820970888755,
    "receivedKBytesPerSec" : 1429.0764634250272,
    "sentKBytesPerSec" : 0.7084200584801847
  },
  "Owner" : {
    "transaction" : "Owner",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7634.601400000011,
    "medianResTime" : 7382.0,
    "minResTime" : 291.0,
    "maxResTime" : 18788.0,
    "pct1ResTime" : 11351.900000000001,
    "pct2ResTime" : 12559.099999999997,
    "pct3ResTime" : 13872.609999999991,
    "throughput" : 4.936126522795032,
    "receivedKBytesPerSec" : 7875.576986914328,
    "sentKBytesPerSec" : 0.5977340711197109
  },
  "POST Edit Owner" : {
    "transaction" : "POST Edit Owner",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14807.36919999998,
    "medianResTime" : 14674.0,
    "minResTime" : 1445.0,
    "maxResTime" : 27596.0,
    "pct1ResTime" : 20131.30000000002,
    "pct2ResTime" : 21330.9,
    "pct3ResTime" : 24127.98,
    "throughput" : 4.869141813755325,
    "receivedKBytesPerSec" : 7877.918571211199,
    "sentKBytesPerSec" : 2.4535909920876446
  },
  "POST new visit-0" : {
    "transaction" : "POST new visit-0",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7182.363599999999,
    "medianResTime" : 7176.0,
    "minResTime" : 824.0,
    "maxResTime" : 16847.0,
    "pct1ResTime" : 10119.900000000001,
    "pct2ResTime" : 11321.799999999996,
    "pct3ResTime" : 13030.669999999993,
    "throughput" : 4.883589868309115,
    "receivedKBytesPerSec" : 0.8965965773848767,
    "sentKBytesPerSec" : 1.4927379187312042
  },
  "New Pet" : {
    "transaction" : "New Pet",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7497.862999999988,
    "medianResTime" : 7265.0,
    "minResTime" : 1235.0,
    "maxResTime" : 17683.0,
    "pct1ResTime" : 10628.500000000004,
    "pct2ResTime" : 11933.95,
    "pct3ResTime" : 13445.99,
    "throughput" : 4.8592281601990335,
    "receivedKBytesPerSec" : 23.147768520948134,
    "sentKBytesPerSec" : 0.8826332400361526
  },
  "POST new visit-1" : {
    "transaction" : "POST new visit-1",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7630.243600000004,
    "medianResTime" : 7480.5,
    "minResTime" : 403.0,
    "maxResTime" : 16205.0,
    "pct1ResTime" : 11077.0,
    "pct2ResTime" : 12182.95,
    "pct3ResTime" : 13439.99,
    "throughput" : 4.905861425113497,
    "receivedKBytesPerSec" : 8244.57257651672,
    "sentKBytesPerSec" : 0.8479858127393447
  },
  "DELETE Pet" : {
    "transaction" : "DELETE Pet",
    "sampleCount" : 5000,
    "errorCount" : 5000,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 4.948520540813913,
    "receivedKBytesPerSec" : 5.818377667128859,
    "sentKBytesPerSec" : 0.0
  },
  "Vets" : {
    "transaction" : "Vets",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2826.7377999999953,
    "medianResTime" : 2632.5,
    "minResTime" : 1.0,
    "maxResTime" : 8385.0,
    "pct1ResTime" : 4949.700000000002,
    "pct2ResTime" : 5980.95,
    "pct3ResTime" : 7332.99,
    "throughput" : 5.042518516127991,
    "receivedKBytesPerSec" : 20.997362258564213,
    "sentKBytesPerSec" : 0.6155418110507802
  },
  "Home page" : {
    "transaction" : "Home page",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3058.206000000008,
    "medianResTime" : 2893.0,
    "minResTime" : 1.0,
    "maxResTime" : 8512.0,
    "pct1ResTime" : 5293.900000000001,
    "pct2ResTime" : 6101.849999999999,
    "pct3ResTime" : 7505.889999999998,
    "throughput" : 5.10218138663004,
    "receivedKBytesPerSec" : 15.889508244104686,
    "sentKBytesPerSec" : 0.5779814852041842
  },
  "JS" : {
    "transaction" : "JS",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2855.479199999999,
    "medianResTime" : 2765.5,
    "minResTime" : 0.0,
    "maxResTime" : 8422.0,
    "pct1ResTime" : 4763.700000000002,
    "pct2ResTime" : 5750.099999999997,
    "pct3ResTime" : 7595.829999999996,
    "throughput" : 5.056552482969531,
    "receivedKBytesPerSec" : 400.01083050334944,
    "sentKBytesPerSec" : 0.8444047603396385
  },
  "Find owner" : {
    "transaction" : "Find owner",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2886.8492000000006,
    "medianResTime" : 2661.5,
    "minResTime" : 1.0,
    "maxResTime" : 9026.0,
    "pct1ResTime" : 5059.0,
    "pct2ResTime" : 6029.95,
    "pct3ResTime" : 7647.939999999999,
    "throughput" : 5.025666076653469,
    "receivedKBytesPerSec" : 18.429078240072048,
    "sentKBytesPerSec" : 0.6233003825537017
  },
  "Find owner with lastname=\"\"" : {
    "transaction" : "Find owner with lastname=\"\"",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6594.510600000011,
    "medianResTime" : 6309.5,
    "minResTime" : 25.0,
    "maxResTime" : 16094.0,
    "pct1ResTime" : 10105.7,
    "pct2ResTime" : 11681.8,
    "pct3ResTime" : 13302.939999999999,
    "throughput" : 4.970480317394991,
    "receivedKBytesPerSec" : 553.572380507168,
    "sentKBytesPerSec" : 0.6407259784141981
  },
  "POST new pet-0" : {
    "transaction" : "POST new pet-0",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7270.473400000016,
    "medianResTime" : 7161.5,
    "minResTime" : 787.0,
    "maxResTime" : 18000.0,
    "pct1ResTime" : 10112.200000000004,
    "pct2ResTime" : 11262.199999999997,
    "pct3ResTime" : 13422.99,
    "throughput" : 4.856844508123072,
    "receivedKBytesPerSec" : 0.8916862964132204,
    "sentKBytesPerSec" : 1.5130208965734964
  },
  "New visit" : {
    "transaction" : "New visit",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7473.040800000026,
    "medianResTime" : 7367.0,
    "minResTime" : 643.0,
    "maxResTime" : 17258.0,
    "pct1ResTime" : 10570.500000000004,
    "pct2ResTime" : 11658.9,
    "pct3ResTime" : 13080.98,
    "throughput" : 4.876145894285157,
    "receivedKBytesPerSec" : 21.037902891554513,
    "sentKBytesPerSec" : 0.9285629388531303
  },
  "POST new pet-1" : {
    "transaction" : "POST new pet-1",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7933.2008000000005,
    "medianResTime" : 7751.0,
    "minResTime" : 572.0,
    "maxResTime" : 18296.0,
    "pct1ResTime" : 11000.7,
    "pct2ResTime" : 12239.95,
    "pct3ResTime" : 13848.939999999999,
    "throughput" : 4.8607965095592425,
    "receivedKBytesPerSec" : 8037.1640209857605,
    "sentKBytesPerSec" : 0.8401962716718613
  },
  "Delete Pet" : {
    "transaction" : "Delete Pet",
    "sampleCount" : 5000,
    "errorCount" : 5000,
    "errorPct" : 100.0,
    "meanResTime" : 6.0E-4,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 4.9485254383898685,
    "receivedKBytesPerSec" : 5.818383425606838,
    "sentKBytesPerSec" : 0.0
  },
  "POST new visit" : {
    "transaction" : "POST new visit",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14811.665799999997,
    "medianResTime" : 14971.5,
    "minResTime" : 2082.0,
    "maxResTime" : 27002.0,
    "pct1ResTime" : 19736.9,
    "pct2ResTime" : 21030.5,
    "pct3ResTime" : 23348.949999999997,
    "throughput" : 4.880586685564298,
    "receivedKBytesPerSec" : 8202.993018259738,
    "sentKBytesPerSec" : 2.3354369882094783
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 105000,
    "errorCount" : 10000,
    "errorPct" : 9.523809,
    "meanResTime" : 6694.836352380931,
    "medianResTime" : 8029.0,
    "minResTime" : 0.0,
    "maxResTime" : 27596.0,
    "pct1ResTime" : 17712.0,
    "pct2ResTime" : 20176.850000000002,
    "pct3ResTime" : 23319.800000000032,
    "throughput" : 100.59889877738804,
    "receivedKBytesPerSec" : 57485.60848920573,
    "sentKBytesPerSec" : 20.827115762506118
  },
  "POST new pet" : {
    "transaction" : "POST new pet",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15202.748200000011,
    "medianResTime" : 15132.5,
    "minResTime" : 4139.0,
    "maxResTime" : 27150.0,
    "pct1ResTime" : 19806.500000000004,
    "pct2ResTime" : 21026.9,
    "pct3ResTime" : 23631.58999999999,
    "throughput" : 4.845341543280044,
    "receivedKBytesPerSec" : 8012.499326951775,
    "sentKBytesPerSec" : 2.3469623100262713
  },
  "Edit Owner" : {
    "transaction" : "Edit Owner",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7187.765800000013,
    "medianResTime" : 6870.0,
    "minResTime" : 114.0,
    "maxResTime" : 19604.0,
    "pct1ResTime" : 10830.0,
    "pct2ResTime" : 12302.9,
    "pct3ResTime" : 13522.98,
    "throughput" : 4.915541171589745,
    "receivedKBytesPerSec" : 26.617847457485485,
    "sentKBytesPerSec" : 0.6192429796240987
  },
  "POST Edit Owner-0" : {
    "transaction" : "POST Edit Owner-0",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6941.111999999993,
    "medianResTime" : 6634.0,
    "minResTime" : 395.0,
    "maxResTime" : 16808.0,
    "pct1ResTime" : 10140.0,
    "pct2ResTime" : 11720.349999999995,
    "pct3ResTime" : 13447.97,
    "throughput" : 4.890783904625802,
    "receivedKBytesPerSec" : 1.4662799401563682,
    "sentKBytesPerSec" : 1.4089660662740344
  },
  "POST Edit Owner-1" : {
    "transaction" : "POST Edit Owner-1",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7867.106200000001,
    "medianResTime" : 7596.5,
    "minResTime" : 431.0,
    "maxResTime" : 18246.0,
    "pct1ResTime" : 11138.100000000006,
    "pct2ResTime" : 12684.099999999997,
    "pct3ResTime" : 14288.98,
    "throughput" : 4.8710534724766,
    "receivedKBytesPerSec" : 7879.55113181363,
    "sentKBytesPerSec" : 1.0512722826341099
  }
}